# Wczytanie pliku modelu 
read_verilog -sv arith_unit_26.sv

# Utworzenie kopi modulu z inna nazwa
copy arith_unit_26 arith_unit_26_rtl 

# Ustawienie hierarchii projektu na nowy modul
hierarchy -top arith_unit_26_rtl 

# Synteza logiczna
synth

# Mapowanie na bramki
abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
opt_clean

# Zapis wyniku symulacji
write_verilog -noattr arith_unit_26_rtl.sv

# Wypisanie statystyki uzytych bramek
stat -tech cmos
